Autodesk.Revit.DB.DirectShapeType.AppendShape(System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject},Autodesk.Revit.DB.DirectShapeTargetViewType)
Appends the collection of Geometry objects into the model or view specific shape representation stored in this DirectShapeType.
Passing DirectShapeTargetViewType.Default as view type will cause the model shape to be updated.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have the correct appearance in Revit.
pGeomArr:
Shape expressed as a collection of Geometry objects
viewType:
Passing DirectShapeTargetViewType.Default as view type will cause the default shape to be appended.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2016

Autodesk.Revit.DB.DirectShapeType.AppendShape(System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject})
Appends the collection of Geometry objects into the model shape representation stored in this DirectShape.
Remarks:
The existing shape will not be cleared by this function, and intersecting or overlapped geometry will not be
joined with the appended geometry. It is up to the caller to ensure that the combination of geometry
will have the correct appearance in Revit.
pGeomArr:
Shape expressed as a collection of Geometry objects
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.DirectShapeType.SetShape(System.Collections.Generic.IList`1{Autodesk.Revit.DB.GeometryObject})
Builds the type shape from the supplied collection of Geometry objects. The objects are copied.
If the new shape is identical to the old one, the old shape will be kept.
pGeomArr:
Shape of this object expressed as a collection of Geometry objects. These will be copied.
Shape and Category should be consistent: geometry supplied as shape should be valid for the Category
the type object is associated with.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.DirectShapeType.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.ElementId)
Creates a DirectShapeType element.
document:
The document that will contain the new element.
name:
Name of the DirectShapeType.
categoryId:
Id of the category assigned to this DirectShapeType. Must be a valid category id.
Returns:
The new DirectShapeType.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Element id categoryId does not correspond to a top-level built-in model category.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015